---
title: FamilyType
classe: Autodesk.Revit.DB.FamilyType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FamilyType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Name { get; }` | `familyType.Name` | String |
| `Nullable<Double> AsDouble(FamilyParameter)` | `familyType.AsDouble(familyParameter)` | Nullable<Double> |
| `ElementId AsElementId(FamilyParameter)` | `familyType.AsElementId(familyParameter)` | ElementId |
| `Nullable<Int32> AsInteger(FamilyParameter)` | `familyType.AsInteger(familyParameter)` | Nullable<Int32> |
| `String AsString(FamilyParameter)` | `familyType.AsString(familyParameter)` | String |
| `String AsValueString(FamilyParameter)` | `familyType.AsValueString(familyParameter)` | String |
| `Boolean HasValue(FamilyParameter)` | `familyType.HasValue(familyParameter)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```